[command]/home/runner/work/_temp/a59c4a68-92eb-4081-9de2-0302d42be60a/terraform-bin plan -out=plan.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # aws_s3_bucket.test_deploy_bucket[0m will be created
[0m  [32m+[0m[0m resource "aws_s3_bucket" "test_deploy_bucket" {
      [32m+[0m[0m acceleration_status         = (known after apply)
      [32m+[0m[0m acl                         = "private"
      [32m+[0m[0m arn                         = (known after apply)
      [32m+[0m[0m bucket                      = "test-deploy-bucket"
      [32m+[0m[0m bucket_domain_name          = (known after apply)
      [32m+[0m[0m bucket_prefix               = (known after apply)
      [32m+[0m[0m bucket_regional_domain_name = (known after apply)
      [32m+[0m[0m force_destroy               = false
      [32m+[0m[0m hosted_zone_id              = (known after apply)
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m object_lock_enabled         = (known after apply)
      [32m+[0m[0m policy                      = (known after apply)
      [32m+[0m[0m region                      = (known after apply)
      [32m+[0m[0m request_payer               = (known after apply)
      [32m+[0m[0m tags_all                    = (known after apply)
      [32m+[0m[0m website_domain              = (known after apply)
      [32m+[0m[0m website_endpoint            = (known after apply)

      [32m+[0m[0m server_side_encryption_configuration {
          [32m+[0m[0m rule {
              [32m+[0m[0m apply_server_side_encryption_by_default {
                  [32m+[0m[0m sse_algorithm = "AES256"
                }
            }
        }

      [32m+[0m[0m versioning {
          [32m+[0m[0m enabled    = true
          [32m+[0m[0m mfa_delete = false
        }
    }

[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mArgument is deprecated[0m
[33m│[0m [0m
[33m│[0m [0m[0m  with aws_s3_bucket.test_deploy_bucket,
[33m│[0m [0m  on main.tf line 1, in resource "aws_s3_bucket" "test_deploy_bucket":
[33m│[0m [0m   1: resource "aws_s3_bucket" "test_deploy_bucket" [4m{[0m[0m
[33m│[0m [0m
[33m│[0m [0mUse the aws_s3_bucket_versioning resource instead
[33m│[0m [0m
[33m│[0m [0m(and 5 more similar warnings elsewhere)
[33m╵[0m[0m
[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mVersion constraints inside provider configuration blocks are deprecated[0m
[33m│[0m [0m
[33m│[0m [0m[0m  on providers.tf line 2, in provider "aws":
[33m│[0m [0m   2:   version = [4m"~> 5.0"[0m[0m
[33m│[0m [0m
[33m│[0m [0mTerraform 0.13 and earlier allowed provider version constraints inside the
[33m│[0m [0mprovider configuration block, but that is now deprecated and will be
[33m│[0m [0mremoved in a future version of Terraform. To silence this warning, move the
[33m│[0m [0mprovider version constraint into the required_providers block.
[33m╵[0m[0m
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  [32m+[0m create[0m%0A%0ATerraform will perform the following actions:%0A%0A[1m  # aws_s3_bucket.test_deploy_bucket[0m will be created%0A[0m  [32m+[0m[0m resource "aws_s3_bucket" "test_deploy_bucket" {%0A      [32m+[0m[0m acceleration_status         = (known after apply)%0A      [32m+[0m[0m acl                         = "private"%0A      [32m+[0m[0m arn                         = (known after apply)%0A      [32m+[0m[0m bucket                      = "test-deploy-bucket"%0A      [32m+[0m[0m bucket_domain_name          = (known after apply)%0A      [32m+[0m[0m bucket_prefix               = (known after apply)%0A      [32m+[0m[0m bucket_regional_domain_name = (known after apply)%0A      [32m+[0m[0m force_destroy               = false%0A      [32m+[0m[0m hosted_zone_id              = (known after apply)%0A      [32m+[0m[0m id                          = (known after apply)%0A      [32m+[0m[0m object_lock_enabled         = (known after apply)%0A      [32m+[0m[0m policy                      = (known after apply)%0A      [32m+[0m[0m region                      = (known after apply)%0A      [32m+[0m[0m request_payer               = (known after apply)%0A      [32m+[0m[0m tags_all                    = (known after apply)%0A      [32m+[0m[0m website_domain              = (known after apply)%0A      [32m+[0m[0m website_endpoint            = (known after apply)%0A%0A      [32m+[0m[0m server_side_encryption_configuration {%0A          [32m+[0m[0m rule {%0A              [32m+[0m[0m apply_server_side_encryption_by_default {%0A                  [32m+[0m[0m sse_algorithm = "AES256"%0A                }%0A            }%0A        }%0A%0A      [32m+[0m[0m versioning {%0A          [32m+[0m[0m enabled    = true%0A          [32m+[0m[0m mfa_delete = false%0A        }%0A    }%0A%0A[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.%0A[0m[33m╷[0m[0m%0A[33m│[0m [0m[1m[33mWarning: [0m[0m[1mArgument is deprecated[0m%0A[33m│[0m [0m%0A[33m│[0m [0m[0m  with aws_s3_bucket.test_deploy_bucket,%0A[33m│[0m [0m  on main.tf line 1, in resource "aws_s3_bucket" "test_deploy_bucket":%0A[33m│[0m [0m   1: resource "aws_s3_bucket" "test_deploy_bucket" [4m{[0m[0m%0A[33m│[0m [0m%0A[33m│[0m [0mUse the aws_s3_bucket_versioning resource instead%0A[33m│[0m [0m%0A[33m│[0m [0m(and 5 more similar warnings elsewhere)%0A[33m╵[0m[0m%0A[33m╷[0m[0m%0A[33m│[0m [0m[1m[33mWarning: [0m[0m[1mVersion constraints inside provider configuration blocks are deprecated[0m%0A[33m│[0m [0m%0A[33m│[0m [0m[0m  on providers.tf line 2, in provider "aws":%0A[33m│[0m [0m   2:   version = [4m"~> 5.0"[0m[0m%0A[33m│[0m [0m%0A[33m│[0m [0mTerraform 0.13 and earlier allowed provider version constraints inside the%0A[33m│[0m [0mprovider configuration block, but that is now deprecated and will be%0A[33m│[0m [0mremoved in a future version of Terraform. To silence this warning, move the%0A[33m│[0m [0mprovider version constraint into the required_providers block.%0A[33m╵[0m[0m%0A[90m%0A─────────────────────────────────────────────────────────────────────────────[0m%0A%0ASaved the plan to: plan.tfplan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "plan.tfplan"%0A
::debug::stderr: 
::debug::exitcode: 0
